import { CATEGORIES } from '@/constants/map';
import { DAYS } from '@/constants/map';

/**
 * 위치 데이터 타입 정의
 */
interface LocationData {
  lat: number; // 위도
  lng: number; // 경도
  name: string; // 위치 이름
  closeDay?: DAYS[]; // 운영하지 않는 일차
  id?: number; // 고유 ID
}

/**
 * 카테고리별 위치 정보
 */
export const LOCATION_DATA: Record<CATEGORIES, LocationData[]> = {
  // 주점
  주점: [
    {
      lat: 37.295669407307464,
      lng: 126.83489418254456,
      name: '차린건 여정도 지만',
      id: 2,
      closeDay: [],
    },
    {
      lat: 37.296037547941225,
      lng: 126.83558981569682,
      name: '폭싹 취EE했수다',
      id: 17,
      closeDay: [],
    },
    {
      lat: 37.29609767733683,
      lng: 126.83509343729206,
      name: '나는 술로',
      id: 3,
      closeDay: [],
    },
    {
      lat: 37.29575349116576,
      lng: 126.8354240789568,
      name: '에바레스트 산악회',
      id: 4,
      closeDay: [],
    },
    {
      lat: 37.295972285664924,
      lng: 126.83563507107027,
      name: '그 시절 우리가 사랑했던 수사',
      id: 5,
      closeDay: [],
    },
    {
      lat: 37.29610790226943,
      lng: 126.83596748746356,
      name: '냥약랜드',
      id: 6,
      closeDay: [],
    },
    {
      lat: 37.29594686026178,
      lng: 126.83516989524996,
      name: '백설공주와 화목한 난쟁이들',
      id: 7,
      closeDay: [],
    },
    {
      lat: 37.29617318030623,
      lng: 126.83593351062571,
      name: '전 어때요',
      id: 8,
      closeDay: [],
    },
    {
      lat: 37.29587712438012,
      lng: 126.83523771733019,
      name: 'Kㅛ통에Bㅏㅂ과 술 Oㅣㅆ어요',
      id: 9,
      closeDay: [],
    },
    {
      lat: 37.29600473137553,
      lng: 126.83467070246739,
      name: '마구먹고 마구마셔',
      id: 10,
      closeDay: [],
    },
    {
      lat: 37.29610731536709,
      lng: 126.83554455043733,
      name: '(주) 로봇산업',
      id: 11,
      closeDay: [],
    },
    {
      lat: 37.29563140425041,
      lng: 126.83510291384758,
      name: '시선',
      id: 12,
      closeDay: [],
    },
    {
      lat: 37.29581860036857,
      lng: 126.83526886032932,
      name: '냥자역학: 주량측정불가',
      id: 13,
      closeDay: [],
    },
    {
      lat: 37.29587420751056,
      lng: 126.83476121468183,
      name: '13주차 술체역학',
      id: 14,
      closeDay: [],
    },
    {
      lat: 37.29594108206853,
      lng: 126.83587480347197,
      name: '냉3 4먹으러 5것지',
      id: 15,
      closeDay: [],
    },
    {
      lat: 37.29572565109832,
      lng: 126.83484330728106,
      name: '그시절 캔마하(CANMAHA)',
      id: 16,
      closeDay: [],
    },
    {
      lat: 37.295964346289615,
      lng: 126.83478639376709,
      name: '나 지피틴데 안 추ㅣㅎㅆ다',
      id: 1,
      closeDay: [],
    },
    {
      lat: 37.2959078111853,
      lng: 126.83462862086351,
      name: '폭주어선',
      id: 18,
      closeDay: [],
    },
    {
      lat: 37.29550032974128,
      lng: 126.83479868682915,
      name: '닭치고 한 잔',
      id: 19,
      closeDay: [],
    },
    {
      lat: 37.29617483410954,
      lng: 126.83550210958191,
      name: '모여봐요 술꾼의 숲',
      id: 20,
      closeDay: [],
    },
    {
      lat: 37.29603016659557,
      lng: 126.83514151762297,
      name: "이랏'스융'마세",
      id: 21,
      closeDay: [],
    },
    {
      lat: 37.29615842637652,
      lng: 126.83504255204929,
      name: '홍문으로들었소',
      id: 22,
      closeDay: [],
    },
    {
      lat: 37.2963082180539,
      lng: 126.83584862945862,
      name: '디대는 못말려! - 오늘도 과제는 ...',
      id: 23,
      closeDay: [],
    },
    {
      lat: 37.296242928313944,
      lng: 126.83587414767518,
      name: '응답하라 일구구산',
      id: 24,
      closeDay: [],
    },
    {
      lat: 37.2958021681218,
      lng: 126.83479238760576,
      name: '뭉쳐야 예체대',
      id: 25,
      closeDay: [],
    },
    {
      lat: 37.29583032980009,
      lng: 126.83560436457206,
      name: 'semi azit',
      id: 26,
      closeDay: [],
    },
  ],
  '주류 구매': [
    {
      lat: 37.295611,
      lng: 126.835208,
      name: '주류 구매',

      closeDay: [],
    },
  ],

  // 플리마켓
  플리마켓: [
    {
      lat: 37.298046,
      lng: 126.834813,
      name: '플리마켓',

      closeDay: [],
    },
  ],

  // 프로모션
  프로모션: [
    {
      lat: 37.297077,
      lng: 126.835742,
      name: '프로모션',

      closeDay: [],
    },
  ],

  // 콘텐츠
  콘텐츠: [
    {
      lat: 37.297562,
      lng: 126.833907,
      name: '호공 레이스',
      closeDay: ['1일차', '3일차'],
      id: 501,
    },
    {
      lat: 37.29665075767112,
      lng: 126.83433657473492,
      name: '피크닉존',
      closeDay: [],
      id: 502,
    },
    {
      lat: 37.29812216872291,
      lng: 126.83629301416545,
      name: '바이킹',
      closeDay: ['1일차', '2일차'],
      id: 503,
    },
    {
      lat: 37.29724736447557,
      lng: 126.83410123695744,
      name: '사탕처럼 달콤하다는데?',
      closeDay: [],
      id: 504,
    },
    // {
    //   lat: 126.83447501648986,
    //   lng: 126.83463357460069,
    //   name: '삐에로 아저씨',
    //   closeDay: [],
    //   id: 505,
    // },
    {
      lat: 37.295566831523274,
      lng: 126.83727412255227,
      name: '한 대 빵!!',
      closeDay: [],
      id: 506,
    },
    {
      lat: 37.29698419132466,
      lng: 126.8343724985793,
      name: '포토존',
      closeDay: ['1일차', '3일차'],
      id: 507,
    },
    {
      lat: 37.29670205742794,
      lng: 126.83397273243898,
      name: '한 대 맞고 더블로 가!',
      closeDay: [],
      id: 508,
    },
    {
      lat: 37.29718649484104,
      lng: 126.83568036283293,
      name: 'PRO:TEEN 스탬프랠리 이벤트',
      closeDay: [],
      id: 509,
    },
    {
      lat: 37.29686240448319,
      lng: 126.83588408022645,
      name: '스탬프랠리',
      closeDay: [],
      id: 510,
    },
  ],

  // 화장실
  화장실: [
    {
      lat: 37.295360594745084,
      lng: 126.83474542074782,
      name: '화장실',

      closeDay: [],
    },
    {
      lat: 37.296472421919674,
      lng: 126.83567909650789,
      name: '화장실',

      closeDay: [],
    },
    {
      lat: 37.29589594299737,
      lng: 126.83259572915954,
      name: '화장실',

      closeDay: [],
    },
  ],

  // 공연장
  공연장: [
    {
      lat: 37.294711,
      lng: 126.833163,
      name: '공연장',

      closeDay: [],
    },
  ],

  // 셔틀콕
  셔틀콕: [
    {
      lat: 37.298714,
      lng: 126.837946,
      name: '셔틀콕',

      closeDay: [],
    },
  ],

  // 푸드트럭
  푸드트럭: [
    {
      lat: 37.296454,
      lng: 126.833895,
      name: '푸드트럭',

      closeDay: [],
    },
  ],

  // 흡연구역
  흡연구역: [
    {
      lat: 37.295385491240424,
      lng: 126.83482995313732,
      name: '흡연구역',
      closeDay: [],
    },
    {
      lat: 37.29649727861849,
      lng: 126.83573543450318,
      name: '흡연구역',
      closeDay: [],
    },
    {
      lat: 37.2959656853379,
      lng: 126.83253354377807,
      name: '흡연구역',
      closeDay: [],
    },
  ],
  // AED
  AED: [
    {
      lat: 37.295669407307464,
      lng: 126.83489418254456,
      name: 'AED 1',
      id: 100,
      closeDay: [],
    },
    {
      lat: 37.296037547941225,
      lng: 126.83558981569682,
      name: 'AED 2',
      id: 101,
      closeDay: [],
    },
  ],
  '온열질환 대비소': [
    // API에서 받아올 데이터로 대체될 예정
  ],
};
