export const singers = {
  '1일차': [],
  '2일차': [
    { start: '17:00', end: '19:00', name: '학생 공연' },
    { start: '19:00', end: '19:40', name: '보이넥스트도어' },
    { start: '19:40', end: '20:10', name: '프로미스나인' },
    { start: '20:10', end: '20:50', name: '빈지노' },
    { start: '20:50', end: '21:30', name: '엔플라잉' },
  ],
  '3일차': [
    { start: '17:00', end: '18:50', name: '학생 공연' },
    { start: '18:50', end: '19:20', name: '하츠투하트' },
    { start: '19:20', end: '19:50', name: '지지원' },
    { start: '19:50', end: '20:30', name: '크라잉넛' },
  ],
};

export const time = ['17:00', '18:00', '19:00', '20:00', '21:00', '22:00'];
